""" 
## 3 - Палиндромом называется слово, которое в обе стороны читается одинаково: "шалаш", "кабак".
А еще есть палиндром числа - смысл также в том, чтобы число в обе стороны читалось одинаково, но есть одно "но".
Если перевернутое число не равно исходному, то они складываются и проверяются на палиндром еще раз.
Это происходит до тех пор, пока не будет найден палиндром.
Напишите такую программу, которая найдет палиндром введенного пользователем числа.
"""

def polindrom_find(number):
    list = str(number)
    result = ''
    for i in list:
        result = i + result
    if int(result) == number:
        print ('Число {} является полиндромом!'.format(number))
    else:
        print ('Число {} не является полиндромом! складываем его с перевернутым числом {} и проводим проверку заново '.format(number, result))
        number+=int(result)
        polindrom_find(number)

while True:
    N = input('Введите положительное число ')
    try:
        N = int(N)
        if N > 0:
            break
    except:
        print ('повторите ввод!')

print(polindrom_find(N))