""" 
## 1 - Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр. Учтите, что числа могут быть отрицательными

Пример:

67.82 -> 23
0.56 -> 11 
"""

while True:
    a = input('Введите вещественное число ')
    try:
        a = float(a)
        break
    except:
        print ('Введено не число!')

if a < 0 :
    a = abs(a)
list = str(a).replace('.','')

result = 0
for i in list:
    result += int(i)
print ('Сумма всех цифр числа {} равна: {}'.format(a, result))


